РП/src/InformationRegisters/НастройкиЗаконодательныхИзменений/НастройкиЗаконодательныхИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЗаконодательныхИзменений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ЗначениеПараметра</name>
    <type>
      <types>Boolean</types>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПараметрНастройки</name>
    <type>
      <types>EnumRef.ПараметрыЗаконодательныхИзменений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/Enums/ПараметрыЗаконодательныхИзменений/ПараметрыЗаконодательныхИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПараметрыЗаконодательныхИзменений</name>
  <enumValues>
    <name>ДатаНачалаИспользованияФормыНН13</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаИспользованияФормыНН15</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаИспользованияФормыТТН2024</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаИспользованияФормыТТН2026</name>
  </enumValues>
</mdclass:Enum>

РП/src/InformationRegisters/НастройкиЗаконодательныхИзменений/ManagerModule.bsl
Функция ЗначениеНастройки(ПараметрНастройки, Период = Неопределено) Экспорт
	
	Результат =  РегистрыСведений.НастройкиЗаконодательныхИзменений.ПолучитьПоследнее(Период, 
		Новый Структура("ПараметрНастройки", Перечисления.ПараметрыЗаконодательныхИзменений[ПараметрНастройки])).ЗначениеПараметра;
		
	Если Результат = Неопределено Тогда
		
		Если ПараметрНастройки = "ДатаНачалаИспользованияФормыНН15" Тогда
			Результат = '20230801';
		КонецЕсли;

		Если ПараметрНастройки = "ДатаНачалаИспользованияФормыТТН2024" Тогда
			Результат = '20250103';
		КонецЕсли;                 
		
		Если ПараметрНастройки = "ДатаНачалаИспользованияФормыТТН2026" Тогда
			Результат = '20260726';
		КонецЕсли;                 
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции
